# SlopeEndHeight Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SlopeEndHeight Property
ParameterTypeId Class See Also
---
"Height Offset at Head"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SlopeEndHeight { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SlopeEndHeight As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SlopeEndHeight {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace